+++
title = "2024年 新年のご挨拶"
author = ["YAMAGAMI"]
date = 2023-12-05T00:00:00+09:00
tags = ["年賀状", "挨拶", "greeting"]
categories = ["social"]
draft = false
+++

## 新年のご挨拶 {#新年のご挨拶}

あけましておめでとうございます。<br />
旧年中はいろいろお世話になりました。本年もどうぞよろしくお願いいたします。

{{< figure src="/2024年賀状.jpg" caption="<span class=\"figure-number\">&#22259;1:  </span>2024年辰年の年賀状。空きスペースにこの記事のURをQRコードシールにして貼りました。住所欄以下は割愛しました。" width="60%" >}}


## 去年のできごと {#去年のできごと}


#### 孫たちの成長 {#孫たちの成長}

小学校4年生になる孫（長男の長男）が夏休みの自由研究でまとめた「 ****川崎港の下！**** 」が「第65回 川崎市立小学校社会科作品展」で表彰されました。写真はそのポスター発表会場でのスナップです。

<a id="figure--takahiro"></a>

{{< figure src="/takahiro_20231021.jpg" width="40%" >}}

幼稚園の年中クラスの孫（長男の次男）にお誕生日プレゼントとして送ったメルセデス・ベンツ。

<a id="figure--kei's Mercedes"></a>

{{< figure src="/慧onメルセデス.png" width="40%" >}}

小学校1年生の孫（長女の長女）の七五三スナップ。

<a id="figure--takahiro"></a>

{{< figure src="/ゆうな七五三.jpg" width="40%" >}}


#### ベリーたちの受難 {#ベリーたちの受難}

北群馬でジューンベリー、レッドカラント、グズベリーを育てて二十年以上になりますが去年はほんとうにひどい年でした。

まず最初は ****ジューンベリー**** 。

4月から5月にかけて例年どおり沢山の実がついているのを確認しました。実が色づく頃から妙に鳥（ヒヨドリ）が多いことは気づいていましたが、そのままスルーしていました。しかし収穫期になってよくよく枝を見ると、何と！実はほとんど食い尽くされていました。

気づいてすぐに脚立を持ってきて、2本の木の全体を覆うように目の細かい防鳥ネットを掛けて害鳥どもが侵入できないようにしました。しかしヒヨドリは空中でホバリングしながら防鳥ネットの網目からクチバシを突っ込んで喰うことができるんですね！ 結局2本の木で収穫できたのはわずかに下の写真に映っただけ😥

<a id="figure--juneberry"></a>

{{< figure src="/june_berry_20230630.jpg" caption="<span class=\"figure-number\">&#22259;2:  </span>ヒヨドリの鳥害のため去年収穫できたのはこれだけ" width="30%" >}}

おっちょこちょいのヒヨドリが2羽、防鳥ネットに引っかかりましたが、彼らは仲間がぶら下がって死んでいても全然気にせずにせっせと実を喰うんですね。

ヒヨドリはジューンべりだけではなく ****レッドカラント**** まで喰いつくしました。

{{< figure src="/redcurrant-sample-img.jpg" caption="<span class=\"figure-number\">&#22259;3:  </span>一昨年のレッドカラント（去年の写真はありません）" width="30%" >}}

大きな株が8株ほどあるので毎年 20Lのバケツに数杯分の収穫があります。しかし去年は洗面器に半分ほどだけ。レッドカラントジャムが希少で美味しいことをご存知の方に少しずつ差し上げていましたが去年は自宅用の2ビンだけとなりました。

2株しかない ****グズベリー**** も鳥害被害を受けました。

{{< figure src="/goose_berry-sample-img.jpg" caption="<span class=\"figure-number\">&#22259;4:  </span>一昨年のグズベリー（これも去年の写真はありません）" width="30%" >}}

ジューンベリーやレッドカラントのように喰い尽くされはしませんでしたが、収量は平年の<span style="color: red">5分の1以下</span>。ヒヨドリがグズベリーの硬くて尖ったトゲを嫌ったのか、サイズが口に入らないので食いにくかったのか、あるいは甘みが少なく酸っぱいのを嫌ったのか、それとも「武士の情け」でせめてこれだけは残してやろうと思ったのか、ほんとうの理由はわかりません。


#### 畑の野菜たち {#畑の野菜たち}

去年は異常な高温のためにいくつかの作物は極端に生育不良となりました。

****豆類**** では、枝豆は収穫<span style="color: red">ゼロ</span> でした。例年収穫期には毎日腹いっぱい食べたのに、去年は文字通り一粒も食べられませんでした。花豆も<span style="color: red">絶滅的</span>不作。翌年向けの種の確保もむずかしいほどでした。一方、同じ豆類でもインゲン、エンドウマメは平年以上の収穫がありました。

****ナス科**** の野菜はわりに元気で、米ナス、ニホンナス、タカノツメそれからピーマンも<span style="color: red">大豊作</span>でした。とても食べきれず保存食に加工するのが大変でした。ミニトマトのアイコ、それから桃太郎も絶好調。アイコは生食の他、大量のドライミニトマトに加工しました。さらにサンマルツァーノも大豊作。サンマルツァーノは一昨年の尻腐れ病の教訓から、カキガラなどのカルシュームのドーピング（追肥）が効いたようです。こちらは全量をトマトソースにしました。

****葉物**** では、ルバーブ、イタリアンパセリ、サニーレタス、オオバなどは<span style="color: red">平年なみ</span>、ルッコラは秋になって涼しくなったらムクムク元気になりました。

その他、ニンニク、ジャガイモも<span style="color: red">平年なみ</span>。キュウリはこれまでの地這いからツル仕立てにしましたがたが、これは食べきれないほどの<span style="color: red">大豊作</span>。長ネギも豊作となりました。


#### けだものたち {#けだものたち}

一昨年はトマトが ****クマ**** に襲われました（<https://x.com/seijiyamagami/status/1562941942891413509?s=20> )。去年は早めにクマのワナが設置されたようで、近隣一帯でクマの食害はありませんでした。その代わりに畑とハウスの周辺にニホンジカが何度も出没。人間が作業していても数メートルほどまで近づいてきます。その都度、怪我をしない程度の小石を投げて追っ払いますが、10メートルほど逃げてはこちを振り向いて「ふん」という感じで人間を小バカにしています。


#### わたしたち {#わたしたち}

年齢相応に二人とも首から上を含む身体各部位がすこしずつ弱ってきていますが幸いなことに今のところ日々の生活に大きな支障はありません。今年ものんびりゆっくりと自然界の漂動に合わせながら日々を過ごして行ければと思っています。
