+++
title = "プレーンテキストファイルで「複式」家計簿（7）"
date = 2019-08-14T12:30:00+09:00
tags = ["ledger", "emacs", "accounting"]
categories = ["comp"]
draft = false
+++

<div class="ox-hugo-toc toc">
<div></div>

<div class="heading">&#30446;&#27425;</div>

- [AndroidタブレットでLedger cli](#androidタブレットでledger-cli)
    - [環境条件](#環境条件)
    - [ポリシイ](#ポリシイ)
    - [実際にやったこと](#実際にやったこと)
    - [ledgerファイルの共有のために・・・](#ledgerファイルの共有のために)
    - [使い方](#使い方)
    - [いまのところ満足しています](#いまのところ満足しています)
- [Acknowledgement](#acknowledgement)

</div>
<!--endtoc-->



## AndroidタブレットでLedger cli {#androidタブレットでledger-cli}

家計簿のみならず全ての会計帳簿は **即時性** と **継続性** を基礎にした **正確さ** が命です。

Ledgerには大きなメリットがたくさんありますが、その一つは、記帳にかかる時間が（他の会計ソフトに比べて）とても短いこと、つまり人間工学的に即時性と継続性を実現しやすくできている点を上げることができます。

しかし、人間は欲深いというか生来のなまけ者というか、Ledgerを使っていると、もっと即応的に、もっと簡便にという欲望が湧いてきます。たとえば、
(1) PCの無い（または使えない）状態で、今すぐファイナンスの状態をチェックしたい、とか
(2) トランザクションが発生した現場で即時的に記帳したい、とかです。

(1)については、ボクの場合にはたとえば「先月のガソリン代は？」、「同じものを別のサイトで購入した時の値段は？」などの他、月ごとの支出額などの **統計的** な推移を確認したくなります。また、(2) については、たとえば冠婚葬祭などのように、そもそも領収書やレシートが発行されない場合があります。

つまり、すでに十分に簡便で高機能なLedgerも使い込んでくると、どうしても補助機として何らかの **モバイル機器** が欲しくなってきます。実際、いろいろなフォーラムなどでも、mobile+Ledgerが繰り返し話題になっています。それらを見ると、便利に使えそうな多種多様な選択肢やアイデアが提案されています。しかし、Mobileギアに求めるものは、その人の置かれている環境によって個人ごとに大きく異なります。これに関しては、すべての人に共通する **最適解** は無いと思います。

ということで、ここではボクが個人的にもっとも快適・便利と思われる補助機の持ち方を紹介しますが、「こんな風な使い方をしているヤツもいるんだ」「人それぞれだね」程度にごらんください。


### 環境条件 {#環境条件}

補助機は次のような環境です。

-   Android タブレット：HUAWAI MediaPad M5
-   Android version：9

スミマセン、HUAWAIがここまで話題になる前のバージョンですw 母艦となるPCはデスクトップLinux(ubuntu16.04)ですが、ほとんどの仕事はThinkPad X230(ubuntu 16.04)で済ませています。


### ポリシイ {#ポリシイ}

次のような機能を実現することを目的としました。

1.  Androidタブレットで、できるだけPCと **同レベル** のledger機能を使えるようにする
2.  Androidタブレットで、現場で **即時的** にトランザクションを書けるようにする
3.  PCとタブレットの間で **安全** に元帳データの共有ができる


### 実際にやったこと {#実際にやったこと}

-   Playストアから **AnLinux** をインストールし、ubuntuを選択
-   Playストアから **Termux** と **Hacker's Keyboard** をインストール
-   その他 `$ pkg install` したものは
    -   **ledger**
    -   **emacs** （自分の好みに調整された `init.el` も複写する）

基本的にはこれだけで、Termuxのターミナル上で次のようなコマンドが動きます：

```nil
$ ledger bal ガソリン -p jul -X JPY
$ ledger reg farming -p aug
$ mbal 交際費
```

最後の `mbal` はこの[シリーズ(4)](http://org2-wp.kgt-yamy.tk/2019/07/07/post-741/)で紹介したスクリプトです。上記コマンドを実行した時の画面イメージは図[1](#orgc1fd26d)のようになります。

<a id="orgc1fd26d"></a>

{{< figure src="/termux-fig1.jpg" caption="&#22259;1:  AndroidタブレットのTermuxでubuntu／Ledgerが動く！" width="90%" >}}

画面下部のキーボードがHacker's Keyboardです。これはLinuxターミナル用にはとても便利。ただ残念なことに日本語対応していません。日本語入力が必要になったら、その都度キーボードを切り替えなければなりません。だれか日本語対応版を作ってくれないでしょうか？

Termuxの細かい使い方はネット上によい紹介がたくさんありますので、そちらをごらんください。ここでは特に気に入っている機能（＝同時に **複数のセッション** を開く機能）だけ、紹介しておきます。

新しいセッションを開きたい時には、現在起動中のTermux画面を左端から右に向かって **スワイプ** します。すると図[2](#org90170cb)のような窓が画面左上に開きます。既存のセッション名がこの窓に表示されます。新規セッションを開くには **NEW SESSION** をタップします。

<a id="org90170cb"></a>

{{< figure src="/sshot2-termux.jpg" caption="&#22259;2:  Termuxで同時に複数セッションを開く" width="80%" >}}

この機能があるので、わりに込み入った作業もTermux上で何とかこなすことができます。もう少し早くから知っていれば人生が違ったものになったのに・・・（言い過ぎですw）

> ＜ **おまけ** ＞ 細かいですが、 `.bash_profile` とか `.bashrc` とかもAnLinux/ubuntuのホームに複写しておくと楽。それから、Ledger関係では `.ledgerrc` , `.prices.db` , `ledger-schedule.ledger` などをホームに複写しておきましょう。


### ledgerファイルの共有のために・・・ {#ledgerファイルの共有のために}

母艦PCとタブレットの間でのデータ共有・交換は、gpgで暗号化したファイルだけにしたいので、 **gnupg** をインストール：

```nil
$ pkg install gnupg
```

これだけです。

あとは、 **syncthing** のインストール。これで、PCとタブレットなどの間でかなり自由度の高いファイル共有・同期が実現します。第１案ではDropbox経由での同期を考えたのですが、総合的に判断して、syncthingを使わせてもらっています。こんなに便利なものがフリーであって良いのか？と申し訳なく思いますが、この辺についてはネット上にたくさん情報がありますので、それをご覧ください。


### 使い方 {#使い方}

以上の準備が終わると、PCが手元にない場合でも、トランザクションの発生時にただちにタブレットを使ってemacsで転記できます。その際、
(1)PCにある大元のledgerファイルをpgpで暗号化したファイルをsyncthingでタブレットの `Sync` ディレクトリに持ってきて、それに追記する形にしても良いし、
(2)それが面倒なら、 `Sync` ディレクトリ配下に、タブレットで緊急避難的にトランザクションをメモするための作業ファイルを用意しておいて、それに書き込んでも良いでしょう。

いずれにしても、ハンドリングするのは基本的に `.gpg` ファイルと決めておいて、素の `.ledger` ファイルはタブレットに残さないようにしています。

また、急にbalまたはregレポートでファイナンスの状況を確認することが必要になったときには、タブレット上でsyncthingを起動し、PC上の `.gpg` ファイルを `Sync` ディレクトリに読み込み復号化した後、ledgerで必要情報をチェックします。この場合にも、作業が終わったら、忘れずに素の `.ledger` ファイルは削除しておきましょう（自分に言い聞かせています）。


### いまのところ満足しています {#いまのところ満足しています}

マイAndroidタブレットでこの設定（AnLinux, Hacker's Keyboard, syncthing, emacs, gnupg）が終わってからは、いつでもどこでもタブレットさえあれば、ある意味なんでもできるようになりました。なので、満足度はきわめて高いのですが、あえて言わせて貰えれば：

-   タブレットの文字が小さくて、 **老眼** には長時間の作業はきついです
-   加齢にともない **指先が乾燥気味** なので、細かいタッチ動作がタブレットに無視されることがあります。指先を舐めてタッチするのも人前ではできませんし・・・。
-   Termuxに入ったemacsのバージョンが26.2、一方PCのほうは数カ月前にようやく25.3に上げたばかり。そのせいか、ちょくちょく細かいことですが想定外のことが起こります。

ま、これらはいずれもシステムの問題ではなくて、自分自身の問題ですね・・・(笑)


## Acknowledgement {#acknowledgement}