+++
title = "ベイナスの育苗"
author = ["YAMAGAMI"]
date = 2021-04-10T00:00:00+09:00
tags = ["farming"]
categories = ["comp"]
draft = false
+++

<div class="ox-hugo-toc toc">
<div></div>

<div class="heading">Table of Contents</div>

- [種まき](#種まき)
- [Footnotes:](#footnotes)

</div>
<!--endtoc-->

北群馬の畑では長年、ふつうの日本ナスを栽培せずベイナスだけにしていました。今年もベイナスで行きます。

ふつうのナスは収穫期がちょっと遅れるとあっというまに巨大化して実がスカスカになります。一方ベイナスは多少収穫が遅れても巨大化はしますがそれほどひどくスカスカにはなりません。

かつて現職だった頃には横浜から通える回数が月に2, 3回、一回の滞在日数は週末のみ最大で3日ほどでした。こんなタイミングだと日本ナスは美味しい状態で食べることはほとんどできません。キュウリもそうです。ちょっと間があくとバットのようになって食べられなくなってしまいます。

退職した今はその気になれば細かく管理が可能です。でもやっぱりベイナスにします。いつのまにか家族ともども味の好みがベイナスに傾いていますので。


## 種まき {#種まき}

3月29日＠横浜。


## Footnotes: {#footnotes}