+++
title = "さようなら, マイPHS！"
date = 2019-04-09T00:00:00+09:00
draft = false
+++

## PHSの最期 {#phsの最期}

Willcom以来、長らくPHS（070-xxxx-yyyy）を愛用していましたが、Willcomが2014年にSoftBank傘下のY!mobileブランドとなったのが運のつき（笑）、悲しいかな、ついに2020年7月にはサービス停止になるとのこと。

4月になっていくらか時間ができたので、この先、音声通話のための携帯電話をどうすべきかについて、ぼくのライフスタイルをベースに、通信料金をできるだけ安く抑えるにはどうしたらよいか、真剣に検討しました。その結果、いわゆるスマホではなくて、Y!mobileの ****Simply**** という単機能の携帯電話（図[1](#orge3fc4d6))に機種変することにしました。

<a id="orge3fc4d6"></a>

{{< figure src="/S603Six500.png" caption="Figure 1: 4月からの通話端末Y!mobile Simply(S603Si)" width="80%" >}}

決め手となったのは次の2点です。

-   電話番号が070-xxxx-yyyyのまま継続できること
-   月額基本料金[^fn:1]が通話（かけ放題的）＋メールで **360円** ) になること（図[2](#org074800b)）

<a id="org074800b"></a>

{{< figure src="/meisai_keitaix300.png" caption="Figure 2: 支払い明細（抜粋）" width="80%" >}}

実際に使い始めてまだ1週間足らずなのですが、数字・文字のボタンが小さくて押しにくい点を除けば、思いのほか音声も聴きやすいし、持ち運びが楽だし、とても満足しています。ちなみに、これで写真を撮ったりすることは ****絶対**** ありませんので、解像度が低いとか、まったく気になりませんｗ


## ということで {#ということで}

ボクの携帯電話番号は昔のままです、みなさん、ご安心くださいｗ

ただし、まだ検証してはいませんが、たぶん、群馬の山中には電波は無く、携帯電話は通じないと思います。その際には, ****@psy...**** のメールアドレスにメールをください。


## Footnote {#footnote}

[^fn:1]: 端末代金は2年間の分割ではなく、あえてて一括支払いにしました。ヨド◯シのカードで支払いをしましたので、10パーセントほどのポイントがつきました。その分、実質割引になる？ 普通の家計では、固定費＝毎月のフローの支出と、耐久消費財の購入費は、なんとなく別立てになりますよね。今回は、端末代金が2万円ほどで安価？なこともあり、「えいやっと」一括で支払いました。ついでながら、もしかしてメールも不要ならば、通話のみの月額基本料金は60円ですｗ