+++
title = "「菊鹿」 – my favorite"
date = 2019-05-20T00:08:00+09:00
draft = false
+++

近年、日本ワインがどんどんレベルを高めていて美味しくなっているのは分かっているつもりです。けれども、コストパファーマンスという意味では、なかなか難しい側面があります。これまで、ボクらが日々飲むワインで、たとえば1,000円前後のワインでいえば、国産ワインは、新世界やフランス、イタリアなどのワインを比べると、申し訳ありませんが、海外のワインを飲んだ方が満足度が高かったです。

それに加えて、ご存知の通り2月1日に日本と欧州連合（EU）による経済連携協定（EPA）が発効しました。この先、EUからの輸入品にかかる関税がワインを含めて大幅に撤廃されます。それを記念して、EUワインのバーゲンが多数の小売店で展開されています。とても喜ばしい流れだとボクは思っています。日本ワインはこれから正念場でしょうか。


## 今日の晩酌は菊鹿 {#今日の晩酌は菊鹿}

ところで今日は、大事に保管していた「菊鹿（きくか）」を満を持して開けて晩酌にしました。ワインのあては、鮮度抜群の群馬県片品村のゼンマイ、コゴミ、そしてカリフォルニア産のアスパラ。それから野性的な群馬のこんにゃくと豆腐の味噌田楽、メインはノールウェイ産の生鮭を全粒粉パン粉をまぶしてフライにしたもの。パンはフランス産小麦粉のフランスパンを焼きたてアツアツ。仕上げは塩分少なめながら、深い滋味にあふれたとろとろクリーミィーなブリー。

<a id="org93f9ee3"></a>

{{< figure src="/kikuka.jpg" width="80%" >}}


## 菊鹿とのゆかり {#菊鹿とのゆかり}

それで、「菊鹿」とボクの関係ですが、まず、日本ワインの中でボクの大好きなワインの一つです。コスパの埒外にある、そんなワインです。

それプラス、「菊鹿」の産地＝熊本県には専修大学の付属高校があります（玉名高等学校）。わずかな数の附属高校しか持たない専修大学の貴重な「資産」「宝」です。その玉名高等学校の校長先生が、ある宴席でご一緒した際に、熊本でも「菊鹿」はなかなか入手がむずかしいとおっしゃっていました。

話は飛びますが、専修大学生田校舎のある小田急線向ヶ丘遊園駅近くに「カルペディエム」というフレンチレストランがあります。向ヶ丘遊園駅から大学に向かうスクールバスが、駅を出て最初の信号で左折した、そのすぐ左側にあるビルの2階にあるレストランです。そのレストランで「菊鹿」が飲めるんです。気のおけない仲間と一緒にワイン＋食事を楽しむのに絶好のレストランです。個室がオススメです。

ところで、カルペディエムとはラテン語で'carpe diem'、その意味は「今を楽しめ」「この瞬間を大切に」ということ。以前、三重県の銘酒「而今」について、ボクのよっぱらいうんちくのブログ（<http://org2-wp.kgt-yamy.tk/2019/04/15/post-612/>）で「而今」の解題をしましたが、ある意味「而今」をラテン語でいえば'carpe diem'。（すみません、ちょっと言いすぎですがｗ）


## じつは・・・ {#じつは}

今日、抜栓したワインはさる3月16日（土）、ボクの定年退職の送別会に際して、熊本に嫁いでいるボクの元ゼミ生のOGがわざわざ熊本から持ってきてくださった1本です。在学中はいろいろなことがあって、卒業が少し遅れたりされました。にもかかわらず、このようなお気遣いをいただきました。

定年退職してまもなく2ヶ月になろうというのに、未だに夢の中にひんぱんに学生諸君が出てきます。ほとんどは卒研や単位取得がうまく行かないという悩みごとについて相談している場面です。胸がドキドキして深夜に目覚めて、「あ、夢だったか、よかった」という夜が続いています。

今宵の「菊鹿」による心地よいほろ酔いは、ボクの教師としての罪の深さを和らげてくれました。ありがとうございました。ごちそうさまでした。


## Acknowledgement {#acknowledgement}